import { ligues } from './ligue.api'

export const articles = [
  {
    id: 1,
    title:
      'Сильно ли Месси оторвался от Левандовского? Рекорды и цифры «Золотого мяча»',
    shortText: 'ЛИОНЕЛЬ МЕССИ ПОЛУЧИЛ «ЗОЛОТОЙ МЯЧ»',
    fullText:
      'Аргентинец победил на тоненького.Никакие голы и рекорды Роберта Левандовского не обеспечили ему «Золотой мяч» – в седьмой раз награда ушла Лионелю Месси. В честь вручения главной индивидуальной награды в мировом футболе мы подвели ключевые статистические итоги. Цифры: Месси снова опередил соперников на полшага. Победа Лео вышла на тоненького: он получил 613 очков по итогам голосования, тогда как у Левандовского — 580. Самый маленький отрыв в истории? Конечно, нет – в 1996-м Маттиас Заммер обошёл Роналдо всего на один пункт. Да даже лично у Месси отрыв от второго места бывал поменьше: от Вирджила ван Дейка он два года назад оторвался всего на семь очков.В предыдущий раз представитель чемпионата Франции получал «Золотой мяч» в 1991 году – за успехи с «Марселем» почтили Жан-Пьера Папена. Предыдущие 11 (!) драгоценных наград ушли представителям испанской Ла Лиги, но до лета Месси играл за «Барселону», так что эту суперсерию сложно назвать по-настоящему завершившейся. Последний раз никакого отношения к Испании победитель не имел ещё в 2008-м, когда Криштиану Роналду помог «Манчестер Юнайтед» выиграть всё. За год до этого была последняя победа представителя Серии А (Кака, приведший к выигрышу ЛЧ «Милан»), а Бундеслига ждёт своего голденбоя с той самой победы Заммера.',
    image:
      'https://img.championat.com/s/735x490/news/big/e/x/lionel-messi-poluchil-zolotoj-myach_1638224622572293225.jpg',
    ligue: ligues.spain,
  },
  {
    id: 2,
    title:
      'Салах сейчас лучший в мире. Почему у «Ливерпуля» такая крутая атака',
    shortText: ' «ЛИВЕРПУЛЬ» — «САУТГЕМПТОН»',
    fullText:
      'В рамках 13-го тура АПЛ «Ливерпуль» принимал «Саутгемптон» – и одержал одну из самых уверенных побед во всём сезоне. Команда не просто выиграла 4:0 – она нанесла 20 ударов по воротам, девять из них в створ и решила все вопросы уже к перерыву. Вот уже 17 матчей подряд «Ливерпуль» забивает минимум два. Единственная команда, получившая от него меньше – «Челси», добившийся на «Энфилде» ничьей 1:1. В чём же секрет атаки красных? При всём уважении к бомбардирским талантам Роберта Левандовского, он не влияет на своих партнёров настолько плодотворно. «Саутгемптону» Салах даже не забил, но зато выдал Диогу Жоте пас прямо на пустые ворота. Благодаря этому он добился очередного уникального достижения: одновременного лидерства и в бомбардирской, и в ассистентской гонках! Действуя максимально широко, Салах ставит в тупик самые разные линии обороны. Его скорость, дриблинг и умение завершать атаки всегда на высочайшем уровне, а начать великолепно конкретно сезон-2021/2022 ему помог ещё и летний отдых. В отличие от множества европейцев и латиносов, африканцы в июне спокойно восстанавливались – и это стало для «Ливерпуля» козырем. В январе Салах и Мане уедут на Кубок Африки, но сейчас они держатся в топе бомбардирской гонки. Сенегалец, кстати, тоже добился прогресса. Но если Салаху спокойное лето помогло выйти с просто высокого уровня на мировой, то Мане «просто» вернулся на высокий уровень после ужасной игры в начале года. Сегодня его гол был отменён из-за миллиметрового офсайда.',
    image:
      'https://img.championat.com/s/735x490/news/big/i/u/liverpul-sautgempton-4-0_1638039960705405120.jpg',
    ligue: ligues.english,
  },
  {
    id: 3,
    title:
      'Роналду первым в истории мирового футбола достиг отметки в 800 голов за карьеру',
    shortText: 'Португалец достиг невиданной ранее высоты',
    fullText:
      'В матче 14-го тура чемпионата Англии «Манчестер Юнайтед» с «Арсеналом» (3:2) Криштиану Роналду оформил дубль. Эти голы стали для португальца 800-м и 801-м в карьере. В составе «красных дьяволов» он забил 130 голов. Роналду стал первым игроком, которому покорилась данная отметка забитых голов в профессиональном футболе.',
    image:
      'https://static.footballhd.ru/uploads/posts/2021-12/1638516268_cr.jpg',
    ligue: ligues.english,
  },
  {
    id: 4,
    title: 'Трент – самый креативный защитник АПЛ',
    shortText: 'ЧЕМПИОНАТ АНГЛИИ',
    fullText:
      'Прямо сейчас Трент Александер-Арнольд является самым дорогим правым защитником в мире. Кроме того, он входит в тройку самых дорогих игроков «Ливерпуля» и занимает 7-е место в рейтинге самых дорогих английских футболистов. Ближайший к нему защитник – Гарри Магуайр – располагается на 12-й позиции и стоит на 25 миллионов меньше. Портал Transfermarkt оценивает воспитанника «красных» в 75 млн евро. Много? Вряд ли. Прямо сейчас Трент – самый креативный защитник в АПЛ. В нынешней кампании Александер-Арнольд сыграл 11 матчей в Премьер-лиге и отдал 7 результативных передач. Столько же, как и в 36-ти поединках прошлого сезона. Кроме того, англичанин оформил 3 ассиста в Лиге чемпионов. Итого: 14 матчей во всех турнирах и 10 результативных передач. Сейчас Трент делит 2-ю строчку с полузащитником «Манчестер Юнайтед» Полем Погба в списке лучших ассистентов Премьер-лиги. Возглавляет этот рейтинг его одноклубник – Мохамед Салах, на счету которого 8 результативных передач. При этом египтянин провел на 2 матча больше, чем англичанин. Выступления Трента на высоком уровне нельзя назвать случайностью. В прошлом сезоне воспитанник «Ливерпуля» отыграл не лучшим образом. Он делал не так много результативных передач и часто допускал потери. Но годом ранее, в кампании 2019/20 Александер-Арнольд отдал 14 результативных передач и стал вторым лучшим ассистентом лиги после Кевина Де Брюйне. Еще раньше, в сезоне 2018/19, англичанин оформил 12 результативных в национальном первенстве. Тогда он стал третьим лучшим ассистентом лиги после Эдена Азара и Райана Фрейзера. В нынешней кампании Трент постепенно возвращается на прежний уровень.В текущем сезоне Александер-Арнольд создал 8 потенциально голевых моментов. Это больше, чем, например, у Бруну Фернандеша (6) и Кевина Де Брюйне (4). Трент создает в среднем 1,72 голевых момента за матч. Это его лучший показатель в карьере. По сравнению с прошлым сезоном у футболиста повысились показатели по точности передач (80,8%/79,4%), количеству длинных передач за матч (5,8/4,2), навесов (2,4/1,9), общих передач за матч (68,6/66,1) и ключевых передач за матч (3,3/2,1).',
    image:
      'https://static.footballhd.ru/uploads/posts/2021-12/1638346841_trent6.jpg',
    ligue: ligues.english,
  },
  {
    id: 5,
    title: 'Гвардиола стал рекордсменом АПЛ',
    shortText: 'ЧЕМПИОНАТ АНГЛИИ',
    fullText:
      '«Манчестер Сити» обыграл «Астон Виллу» в матче 14-го тура английской Премьер-лиги (2:1). Эта победа стала 150-й в АПЛ для наставника «горожан» Хосепа Гвардиолы. Испанец быстрее всех одержал 150 побед в Премьер-лиге, сообщает William Hill. Для этого ему понадобилось 203 матча.Предыдущим рекордсменом по этому показателю был экс-наставник «Челси», «МЮ» и «Тоттенхэма» Жозе Моуринью. Португалец одержал 150 побед в 230-ти матчах АПЛ.',
    image:
      'https://static.footballhd.ru/uploads/posts/2021-12/1638423965_guardiola4.jpg',
    ligue: ligues.english,
  },

  {
    id: 6,
    title: 'Инсинье зимой может отправиться в АПЛ',
    shortText: 'ЧЕМПИОНАТ АНГЛИИ',
    fullText:
      'La Gazzetta dello Sport утверждает, что в услугах 30-летнего Лоренцо Инсинье якобы заинтересован «Тоттенхэм». «Шпоры» рассматривают вариант с приобретением форварда в предстоящее зимнее трансферное окно. «Наполи», согласно имеющейся информации, не станет препятствовать заключению сделки, так как не хочет отпускать форварда в другую команду бесплатно будущим летом. Цвета неаполитанцев Инсинье защищает с 2009 года. В нынешнем сезоне нападающий принял участие в 13 матчах итальянской Серии А, забил 4 гола, сделал 5 ассистов.',
    image:
      'https://static.footballhd.ru/uploads/posts/2021-12/1638386555_insinie.jpeg',
    ligue: ligues.italy,
  },
]

const fetchAll = () =>
  new Promise((resolve) => {
    window.setTimeout(function () {
      resolve(articles)
    }, 2000)
  })

const getById = (id) =>
  new Promise((resolve) => {
    window.setTimeout(function () {
      resolve(articles.find((article) => article.id.toString() === id))
    }, 1000)
  })

export default {
  fetchAll,
  getById,
}
